export class AddressUtils {
    // For details see https://uk.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%BA%D0%BE%D0%B4%D1%96%D0%B2_%D0%9A%D0%9E%D0%90%D0%A2%D0%A3%D0%A3_%D0%B4%D0%BB%D1%8F_%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D0%B5%D0%B9
    private readonly regionAtuIdByCode: Record<string, number> = {
        '01': 1, // Автономна Республіка Крим
        '05': 2, // Вінницька область
        '07': 3, // Волинська область
        '12': 4, // Дніпропетровська область
        '14': 5, // Донецька область
        '18': 6, // Житомирська область
        '21': 7, // Закарпатська область
        '23': 8, // Запорізька область
        '26': 9, // Івано-Франківська область
        '32': 10, // Київська область
        '35': 11, // Кіровоградська область
        '44': 12, // Луганська область
        '46': 13, // Львівська область
        '48': 14, // Миколаївська область
        '51': 15, // Одеська область
        '53': 16, // Полтавська область
        '56': 17, // Рівненська область
        '59': 18, // Сумська область
        '61': 19, // Тернопільська область
        '63': 20, // Харківська область
        '65': 21, // Херсонська область
        '68': 22, // Хмельницька область
        '71': 23, // Черкаська область
        '73': 24, // Чернівецька область
        '74': 25, // Чернігівська область
        '80': 26, // Київ
        '85': 27, // Севастополь
    }

    getRegionAtuIdByKatottgCode(katottgCode: string): number | null {
        const code = katottgCode.slice(2, 4)

        return this.regionAtuIdByCode[code] ?? null
    }
}
